{
    "title": {
        "uz": "Temir odam 3",
        "ru": "Железный человек 3",
        "en": "Iron man 3"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": "English language temporary not working"
    },
    "description": {
        "uz": "Marvelning \"Temir odam 3\" filmi jasur, ammo zo'r sanoatchi Toni Stark/Temir odamni qo'li chegara bilmaydigan dushmanga qarshi qo'yadi. Stark o'zining shaxsiy dunyosi dushman qo'lida vayron bo'lganini ko'rgach, u aybdorlarni topish uchun dahshatli izlanishga kirishadi. Bu sayohat, har qadamda, uning jasoratini sinab ko'radi. Orqasi devorga suyanib, Stark o'zining zukkoligi va instinktlariga tayanib, o'zining eng yaqinlarini himoya qiladi. U orqaga qaytish uchun kurashayotganida, Stark uni yashirincha ta'qib qilgan savolga javob topadi: erkak kostyum tikadimi yoki kostyum erkakmi?",
        "ru": "В фильме «Железный человек 3» от Marvel дерзкий, но блестящий промышленник Тони Старк/Железный человек сражается с врагом, чья мощь не знает границ. Когда Старк обнаруживает, что его личный мир разрушен руками врага, он отправляется на мучительный поиск виновных. Это путешествие на каждом шагу будет проверять его характер. Прижавшись спиной к стене, Старку приходится выживать с помощью своих собственных средств, полагаясь на свою изобретательность и инстинкты, чтобы защитить самых близких ему людей. Пробираясь обратно, Старк находит ответ на вопрос, который тайно преследовал его: мужчина делает костюм или костюм делает человека?",
        "en": "Marvel's \"Iron Man 3\" pits brash-but-brilliant industrialist Tony Stark/Iron Man against an enemy whose reach knows no bounds. When Stark finds his personal world destroyed at his enemy's hands, he embarks on a harrowing quest to find those responsible. This journey, at every turn, will test his mettle. With his back against the wall, Stark is left to survive by his own devices, relying on his ingenuity and instincts to protect those closest to him. As he fights his way back, Stark discovers the answer to the question that has secretly haunted him: does the man make the suit or does the suit make the man?"
    },
    "releaseDate": {
        "day": "03",
        "month": "05",
        "year": "2013"
    },
    "duration": {
        "hour": "02",
        "min": "10"
    },
    "rating": {
        "like": 2,
        "dislike": 0,
        "imdb": "N/A"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Top films",
        "ru": "Smile movie",
        "en": "Smile movie"
    },
    "image": {
        "portrait": "https://m.media-amazon.com/images/M/MV5BMjE5MzcyNjk1M15BMl5BanBnXkFtZTcwMjQ4MjcxOQ@@._V1_.jpg",
        "fullscreen": "https://wallpapercave.com/wp/wp1886659.jpg"
    },
    "status": {
        "isNew": false,
        "isTrending": true,
        "type": "movie",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://smile-movie.netlify.app/playerjs.html?file=[480p] http://topfilm.info/3/tarjima_kinolar/Temir_Odam_3_480.mp4,[720p]http://topfilm.info/3/tarjima_kinolar/Temir_Odam_3_720.mp4,[1080p]http://topfilm.info/3/tarjima_kinolar/Temir_Odam_3_1080.mp4",
        "ru": "https://2186.svetacdn.in/8JRlKdovCCwf/movie/140?block=RU,SG,NL,IN,EE,CA",
        "en": "https://smile-movie.netlify.app/playerjs.html?file=https://pdrz.v41f5cdbeef.site/_v2-pvwv/12a3c523fd105800ed8c394685aeeb0bc22ea05c00baf6ec031a7baea93ece832257df1a4b6125fcfa38c35da05dee86aad28d46d73fc4e9d4e5a43a5476f3d730c714e30918b40a5691a6b039107b126566d17340173392c2dbfb4a8cbe6c9c7947a21a0667b702b9f07740f310/h/list;15a38634f803584ba8926411d7bee906856cab0654b5ba.m3u8&subtitle=[English]https://rapidcdn.cc//sub//cache//subtitle//13978456.vtt"
    },
    "_id": "6641a6b9af6db12c123ffdbf",
    "trailer": "https://www.youtube.com/embed/Ke1Y3P9D0Bc",
    "comments": [],
    "__v": 22
},
{
    "title": {
        "uz": "O'rgimchak odam 3",
        "ru": "Человек-паук 3",
        "en": "Spider Man 3"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "Piter “buyuk kuch bilan katta mas'uliyat keladi!” deb tushunganiga besh yil bo'ldi va uch yil. chunki u adolat uchun kurashuvchi bo'lishdan bosh tortdi. Ammo endi Butrus bir necha hayot kechirishni mukammal o'rganganga o'xshaydi. U yaxshi talaba, Nyu-York uni qahramon sifatida tan olgan, Meri Jeyn bilan munosabatlari kuchli. Piter hatto unga turmush qurishni taklif qilmoqchi ham! Ammo, afsuski, uning eng yaqin do'sti Garri Osborn hamon otasining bevaqt o'limi uchun O'rgimchak odam aybdor deb hisoblaydi. Garri undan Yangi Goblin qiyofasida qasos olishga kirishadi. Shu bilan birga, Nyu-Yorkdagi jinoyat sahnasida Sandman nomi bilan mashhur bo'lgan yana bir kuchli yovuz odam paydo bo'ladi. O'rgimchak-odam sirli qora kostyumni kiyganida, uning qorong'uroq, qasoskor tomoni uni butunlay yutib yuboradi. Bu o'zgarishlar uni o'zining eng kuchli raqibi - o'zi bilan to'qnash kelishga majbur qiladi...",
        "ru": "Питер: «С великой силой приходит и большая ответственность!» Прошло пять лет с тех пор, как он это понял, и три года. потому что он отказался быть борцом за справедливость. Но теперь Питер, кажется, овладел искусством проживать несколько жизней. Он хорошо учится, Нью-Йорк признает его героем, и у него крепкие отношения с Мэри Джейн. Питер даже хочет сделать ей предложение! Но, к сожалению, его лучший друг Гарри Осборн до сих пор считает, что в безвременной смерти его отца виноват Человек-Паук. Гарри мстит ему в образе Нового Гоблина. Тем временем на месте преступления Нью-Йорка появляется еще один могущественный злодей, известный как Песочный человек. Когда Человек-Паук надевает загадочный черный костюм, его темная, мстительная сторона поглощает его целиком. Эти изменения вынуждают его встретиться лицом к лицу со своим величайшим соперником — самим собой…",
        "en": "Peter \"with great power comes great responsibility!\" It's been five years since he realized that and three years. because he refused to be a fighter for justice. But now Peter seems to have mastered the art of living multiple lives. He is a good student, New York recognizes him as a hero, and he has a strong relationship with Mary Jane. Peter even wants to propose to her! But unfortunately, his best friend Harry Osborn still believes that Spider-Man is responsible for his father's untimely death. Harry takes revenge on him in the form of the New Goblin. Meanwhile, another powerful villain known as the Sandman appears on the New York crime scene. When Spider-Man dons the mysterious black suit, his darker, vengeful side consumes him whole. These changes force him to face his greatest rival - himself..."
    },
    "releaseDate": {
        "day": "04",
        "month": "05",
        "year": "2007"
    },
    "duration": {
        "hour": "02",
        "min": "19"
    },
    "rating": {
        "like": 1,
        "dislike": 0,
        "imdb": "N/A"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Top films",
        "ru": "Smile Movie",
        "en": "Smile Movie"
    },
    "image": {
        "portrait": "https://m.media-amazon.com/images/M/MV5BYTk3MDljOWQtNGI2My00OTEzLTlhYjQtOTQ4ODM2MzUwY2IwXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg",
        "fullscreen": "https://w0.peakpx.com/wallpaper/292/521/HD-wallpaper-spider-man-spider-man-3-2007.jpg"
    },
    "status": {
        "isNew": false,
        "isTrending": false,
        "type": "movie",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://smile-movie.netlify.app/playerjs.html?file=[480p]https://topfilm.info/3/tarjima_kinolar/O'RGIMCHAK_ODAM_3_480.mp4,[1080p]https://topfilm.info/3/tarjima_kinolar/O'RGIMCHAK_ODAM_3_1080.mp4",
        "ru": "https://64544.svetacdn.in/8JRlKdovCCwf/movie/1559?block=RU,SG,NL,IN,EE,CA",
        "en": "https://vidsrc.to/embed/movie/tt0413300"
    },
    "_id": "6641b948af6db12c123fff92",
    "trailer": "https://www.youtube.com/embed/e5wUilOeOmg?si=4uBLxB5KJ4cTF475",
    "comments": [],
    "__v": 1
},
{
    "title": {
        "uz": "Kung Fu Panda 4",
        "ru": "Кунг-фу Панда 4",
        "en": "Kung Fu Panda 4"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "Po o'zining Tinchlik vodiysining ruhiy rahbari bo'lishga tayyorlanmoqda, ammo uning o'rnini Ajdaho jangchisi sifatida egallash uchun kimdir kerak. Shunday qilib, u yangi kung-fu amaliyotchisini o'rgatadi va o'tmishdagi yovuz odamlarni sehrlaydigan Xameleon ismli yovuz odamga duch keladi.",
        "ru": "По готовится стать духовным лидером своей Долины Мира, но ему также нужен кто-то, кто займет его место Воина Дракона. Таким образом, он будет обучать нового практикующего кунг-фу для этого места и столкнется со злодеем по имени Хамелеон, который вызывает злодеев из прошлого.",
        "en": "Po is gearing up to become the spiritual leader of his Valley of Peace, but also needs someone to take his place as Dragon Warrior. As such, he will train a new kung fu practitioner for the spot and will encounter a villain called the Chameleon who conjures villains from the past."
    },
    "releaseDate": {
        "day": "08",
        "month": "03",
        "year": "2024"
    },
    "duration": {
        "hour": "01",
        "min": "34"
    },
    "rating": {
        "like": 4,
        "dislike": 0,
        "imdb": "N/A"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Mover uz",
        "ru": "Smile Movie",
        "en": "Smile Movie"
    },
    "image": {
        "portrait": "https://m.media-amazon.com/images/M/MV5BZDY0YzI0OTctYjVhYy00MTVhLWE0NTgtYTRmYTBmOTE3YTViXkEyXkFqcGdeQXVyMTUzMTg2ODkz._V1_FMjpg_UX1000_.jpg",
        "fullscreen": "https://4kwallpapers.com/images/wallpapers/kung-fu-panda-4-2880x1800-15545.jpg"
    },
    "status": {
        "isNew": true,
        "isTrending": true,
        "type": "cartoon",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://smile-movie.netlify.app/playerjs.html?file=https://uzfayil.top/Kino/Panda%204.mp4",
        "ru": "https://tremendous-week.cdnmovies-stream.online/content/f05bb274b621ebe986e2607226b5314c/iframe?geo_block=RU,SG,NL,IN,EE,CA",
        "en": "https://vidsrc.to/embed/movie/tt21692408"
    },
    "_id": "6641c664af6db12c124000d8",
    "trailer": "https://www.youtube.com/embed/_inKs4eeHiI?si=I2trSdiR5srtXCsb",
    "comments": [],
    "__v": 8
},
{
    "title": {
        "uz": "Hayvonlar shahri",
        "ru": "Зверополис",
        "en": "Zootopia"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "Zootopiaga xush kelibsiz - ulkan fillardan tortib mayda sichqonlargacha bo?lgan turli hayvonlar yashaydigan zamonaviy shahar. Zootopia turli aholining tabiiy yashash joylarini to'liq takrorlaydigan hududlarga bo'lingan - u erda elita maydoni Sahara maydoni va yashash uchun qulay bo'lmagan Tundratown mavjud. Bu shaharda yangi politsiya zobiti, quvnoq quyon Judi Xopps paydo bo'ladi, u ishning birinchi kunlaridanoq katta va kuchli politsiyachilar orasida kichkina va bekamu ko'st bo'lish qanchalik qiyinligini tushunadi. Judi sherigi suhbatdosh, ayyor tulki Nik Uayld bo'lishiga qaramay, o'zini isbotlash uchun birinchi imkoniyatdan sakraydi. Ular birgalikda Zootopiyaning barcha aholisining taqdiri bog'liq bo'lgan qiyin ishni hal qilishlari kerak.",
        "ru": "Добро пожаловать в Зверополис — современный город с множеством животных, от гигантских слонов до крошечных мышей. Зверополис разделен на территории, полностью повторяющие естественную среду обитания разных популяций — есть элитная зона, район Сахары и Тундратаун, непригодный для проживания. В этом городе появляется новый полицейский, веселая зайка Джуди Хоппс, которая с первых дней на службе понимает, как сложно быть маленьким и пушистым среди больших и сильных полицейских. Джуди ухватывается за первую возможность проявить себя, несмотря на то, что ее партнером является болтливый и хитрый лис Ник Уайлд. Вместе им предстоит решить сложную задачу, от которой зависит судьба всех жителей Зверополиса.",
        "en": "Welcome to Zootopia, a modern city filled with animals ranging from giant elephants to tiny mice. Zootopia is divided into territories that completely replicate the natural habitat of different populations - there is an elite zone, the Sahara region and Tundratown, which is unsuitable for living. A new policeman appears in this city, the cheerful bunny Judy Hopps, who from her first days in the service understands how difficult it is to be small and fluffy among the big and strong police officers. Judy seizes the first opportunity to prove herself, despite the fact that her partner is the talkative and cunning fox Nick Wilde. Together they will have to solve a difficult task on which the fate of all residents of Zootopia depends."
    },
    "releaseDate": {
        "day": "04",
        "month": "03",
        "year": "2016"
    },
    "duration": {
        "hour": "01",
        "min": "48"
    },
    "rating": {
        "like": 0,
        "dislike": 0,
        "imdb": "8"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Top Films",
        "ru": "Smile Movie",
        "en": "Smile Movie"
    },
    "image": {
        "portrait": "https://i.ebayimg.com/images/g/7qwAAOSwDyhgBjDv/s-l1600.jpg",
        "fullscreen": "https://c4.wallpaperflare.com/wallpaper/484/853/233/zootopia-judy-hopps-nick-wilde-4k-wallpaper-preview.jpg"
    },
    "status": {
        "isNew": false,
        "isTrending": false,
        "type": "cartoon",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://smile-movie.netlify.app/playerjs.html?file=[{\"title\": \"Oddiy\", \"file\": \"[480p]https://topfilm.info/2/MULTIFILM/Hayvonlar_shahri_480.mp4,[720p]https://topfilm.info/2/MULTIFILM/Hayvonlar_shahri_720.mp4\"},{\"title\": \"Original\", \"file\": \"[720p]http://fayllar1.ru/12/Zootopiya%20720p%20O%27zbek%20tilida%20(asilmedia.net).mp4,[1080p]http://fayllar1.ru/11/Zootopiya%20Multfilm%20(2%20xil%20audio)%20Full%20HD%20O%27zbek%20tilida%20(asilmedia.net).mp4\"}]",
        "ru": "https://80363.svetacdn.in/8JRlKdovCCwf/movie/246?block=RU,SG,NL,IN,EE,CA",
        "en": "https://vidsrc.to/embed/movie/tt2948356"
    },
    "_id": "6641ede3619600de0f8ced13",
    "trailer": "https://www.youtube.com/embed/jWM0ct-OLsM?si=sT3SN0Tqd05nHKJt",
    "comments": [],
    "__v": 0
},
{
    "title": {
        "uz": "Etik Kiygan Mushuk 1",
        "ru": "Кот в сапогах 1",
        "en": "Puss in Boots 1"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "Shrekning eng sevimli qahramonlaridan biri - Puss bilan bo'lgan sarguzashtlarda qilichlar o'tadi va yuraklar sinadi. Botlarda. Bu Puss in Bootsning dastlabki yillarida aqlli Humpty Dumpty va zukko Kitti bilan hamkorlikda oltin tuxum qo'yuvchi mashhur Gozni o'g'irlashda ajoyib sayohati.",
        "ru": "Мечи скрещиваются, а сердца разбиваются в приключениях с Котом, одним из самых любимых персонажей Шрека. В ботах. Это чудесное путешествие Кота в Сапогах в его ранние годы, когда он объединяется с умным Шалтаем-Болтаем и умной Китти, чтобы украсть знаменитую Гусыню, несущую золотое яйцо.",
        "en": "Swords cross and hearts break in adventures with Puss, one of Shrek's most beloved characters. In bots. This is a wonderful journey of Puss in Boots in his early years as he teams up with clever Humpty Dumpty and clever Kitty to steal the famous Goose that lays the golden egg."
    },
    "releaseDate": {
        "day": "14",
        "month": "01",
        "year": "2011"
    },
    "duration": {
        "hour": "01",
        "min": "30"
    },
    "rating": {
        "like": 0,
        "dislike": 0,
        "imdb": "6.6"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Top Films",
        "ru": "Smile Movie",
        "en": "Smile Movie"
    },
    "image": {
        "portrait": "https://m.media-amazon.com/images/M/MV5BMWZiZTc0NTktNzNmZC00M2M3LTkwMDMtZGU3Mzg4NWI0ZjdjXkEyXkFqcGdeQXVyNTgyNTA4MjM@._V1_FMjpg_UX1000_.jpg",
        "fullscreen": "https://images6.alphacoders.com/131/1318903.jpeg"
    },
    "status": {
        "isNew": false,
        "isTrending": false,
        "type": "cartoon",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://topfilms.me/new_player/playerjs.html?file=http://topfilm.info/3/tarjima_kinolar/ETIK_KIYGAN_MUSHUK_1_360.mp4,http://topfilm.info/4/tarjima_kinolar/ETIK_KIYGAN_MUSHUK_1_480.mp4,http://topfilm.info/3/tarjima_kinolar/ETIK_KIYGAN_MUSHUK_1_720.mp4,http://topfilm.info/4/tarjima_kinolar/ETIK_KIYGAN_MUSHUK_1_1080.mp4&qualities=MOB%20360P,SD%20480P,HD%20720P,FHD%201080P",
        "ru": "https://15846.svetacdn.in/8JRlKdovCCwf/movie/634?block=RU,SG,NL,IN,EE,CA",
        "en": "https://vidsrc.to/embed/movie/tt0448694"
    },
    "_id": "664239da33d1786efda5e758",
    "trailer": "https://www.youtube.com/embed/1esRrwrmWzA?si=CdCoiTSjvjwsoD81",
    "comments": [],
    "__v": 0
},
{
    "title": {
        "uz": "Interstellar",
        "ru": "Интерстеллар",
        "en": "Interstellar"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "Yer kelajagi falokatlar, ocharchilik va qurg'oqchilik bilan to'lib-toshgan. Insoniyatning omon qolishini ta'minlashning yagona yo'li bor: yulduzlararo sayohat. Quyosh sistemamizning olis chekkalarida yangi kashf etilgan qurt teshigi astronavtlar jamoasiga ilgari hech kim bormagan joyga borishga imkon beradi, bu sayyorada inson hayotini saqlab qolish uchun qulay muhit mavjud.",
        "ru": "Будущее Земли пронизано катастрофами, голодом и засухой. Есть только один способ обеспечить выживание человечества: межзвездные путешествия. Недавно обнаруженная червоточина в дальних уголках нашей солнечной системы позволяет команде астронавтов отправиться туда, куда раньше не ступал ни один человек, на планету, на которой могут быть подходящие условия для поддержания человеческой жизни.",
        "en": "Earth's future has been riddled by disasters, famines, and droughts. There is only one way to ensure mankind's survival: Interstellar travel. A newly discovered wormhole in the far reaches of our solar system allows a team of astronauts to go where no man has gone before, a planet that may have the right environment to sustain human life."
    },
    "releaseDate": {
        "day": "26",
        "month": "10",
        "year": "2014"
    },
    "duration": {
        "hour": "02",
        "min": "49"
    },
    "rating": {
        "like": 2,
        "dislike": 0,
        "imdb": "N/A"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Top Films",
        "ru": "Smile Movies",
        "en": "Smile Movies"
    },
    "image": {
        "portrait": "https://i.ebayimg.com/images/g/zu4AAOSw2spbJQ0J/s-l1600.jpg",
        "fullscreen": "https://images3.alphacoders.com/551/thumb-1920-551456.jpg"
    },
    "status": {
        "isNew": false,
        "isTrending": true,
        "type": "movie",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://topfilms.me/new_player/playerjs.html?file=https://topfilm.info/3/tarjima_kinolar/INTERSTELLAR_360.mp4,https://topfilm.info/4/tarjima_kinolar/INTERSTELLAR_480.mp4,https://topfilm.info/3/tarjima_kinolar/INTERSTELLAR_720.mp4,https://topfilm.info/4/tarjima_kinolar/INTERSTELLAR_1080.mp4&qualities=MOB%20360P,SD%20480P,HD%20720P,FHD%201080P",
        "ru": "https://74176.svetacdn.in/8JRlKdovCCwf/movie/16?block=RU,SG,NL,IN,EE,CA",
        "en": "https://vidsrc.to/embed/movie/tt0816692"
    },
    "_id": "6646df695a36232dce0bb36b",
    "trailer": "https://www.youtube.com/embed/zSWdZVtXT7E?si=1iJu-ZK56rE-pt7x\" title=\"YouTube video player\" frameborder=\"0",
    "comments": [],
    "__v": 11
},
{
    "title": {
        "uz": "Etik Kiygan Mushuk 2",
        "ru": "Кот в сапогах 2",
        "en": "Puss in Boots 2"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "Achinarlisi, “Botinkali mushuk” (2011) filmidagi voqealardan o‘n yil o‘tib, jasoratsiz ispan oshiqi va qahramoni, endi to‘qqiz umrining so‘nggisigacha qoldi. Va go'yo bu etarli bo'lmagandek, uning ortidan \"Katta yomon bo'ri\" nomi bilan mashhur bo'lgan to'xtatib bo'lmaydigan ne'mat ovchisi bor. O'zining barcha qimmatli hayotini tiklash va shafqatsiz taqdirdan qutulish uchun Puss afsonaviy tilaklar yulduzini topish uchun Qorong'u o'rmonga xavfli qidiruvni boshlash uchun jasoratini yig'ishi kerak. Biroq, Puss sehrli yulduz xaritasini qidirayotgan yagona odam emas. Jasoratli qonunbuzar o'z mahoratini ishga solib, qo'llarini olishga qaror qilgan dahshatli dushmanlardan bir qadam oldinda bo'lish uchun juda muhim savol tug'iladi: u o'zining eng mohir va dahshatli raqibi bilan to'qnash kelish va o'z hayotini qaytarish uchun nima kerakligiga egami? yo'lda?",
        "ru": "К сожалению, Кот в сапогах, бесстрашный испанский любовник и герой, дожил до последней из своих девяти жизней, спустя десять лет после событий «Кота в сапогах» (2011). И как будто этого было недостаточно, за ним охотится неудержимый охотник за головами, известный как Большой Злой Волк. Чтобы восстановить все свои драгоценные жизни и избежать бесславной участи, Кот должен набраться смелости и отправиться в опасное путешествие в Темный Лес в поисках легендарной Звезды Желаний. Однако Кот не единственный, кто ищет карту волшебной звезды. Поскольку отважный преступник находит хорошее применение своим навыкам, чтобы оставаться на шаг впереди грозных противников, полных решимости заполучить его, возникает решающий вопрос: есть ли у него все необходимое, чтобы встретиться со своим самым опытным и устрашающим противником и вернуть себе жизнь? на ходу?",
        "en": "Sadly, Puss in Boots, the undaunted Spanish lover and hero, is now down to the last of his nine lives, a decade after the events of Puss in Boots (2011). And as if that weren't enough, the unstoppable bounty hunter known as The Big Bad Wolf is after him. To restore all of his precious lives and escape an inglorious fate, Puss must pluck up his courage to embark on a dangerous quest into the Dark Forest to find the legendary Wishing Star. However, Puss isn't the only one seeking the map to the magical star. As the daring outlaw puts his skills to good use to stay one step ahead of formidable adversaries determined to get their hands on it, a crucial question arises: Does he have what it takes to face his most skilled and terrifying opponent and get his life back on track?"
    },
    "releaseDate": {
        "day": "21",
        "month": "12",
        "year": "2022"
    },
    "duration": {
        "hour": "01",
        "min": "42"
    },
    "rating": {
        "like": 3,
        "dislike": 0,
        "imdb": "N/A"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Top Films",
        "ru": "Smile Movies",
        "en": "Smile Movies"
    },
    "image": {
        "portrait": "https://m.media-amazon.com/images/M/MV5BNjMyMDBjMGUtNDUzZi00N2MwLTg1MjItZTk2MDE1OTZmNTYxXkEyXkFqcGdeQXVyMTQ5NjA0NDM0._V1_FMjpg_UX1000_.jpg",
        "fullscreen": "https://i0.wp.com/www.irishfilmcritic.com/wp-content/uploads/2022/03/Puss-in-Boots-1.jpg?fit=1392%2C696&ssl=1"
    },
    "status": {
        "isNew": true,
        "isTrending": true,
        "type": "cartoon",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://topfilms.me/new_player/playerjs.html?file=http://topfilm.info/3/tarjima_kinolar/ETIK_KIYGAN_MUSHUK_2_360.mp4,http://topfilm.info/4/tarjima_kinolar/ETIK_KIYGAN_MUSHUK_2_480.mp4,http://topfilm.info/3/tarjima_kinolar/ETIK_KIYGAN_MUSHUK_2_720.mp4,http://topfilm.info/4/tarjima_kinolar/ETIK_KIYGAN_MUSHUK_2_1080.mp4&qualities=MOB%20360P,SD%20480P,HD%20720P,FHD%201080P",
        "ru": "https://32801.svetacdn.in/8JRlKdovCCwf/movie/63676?block=RU,SG,NL,IN,EE,CA",
        "en": "https://vidsrc.to/embed/movie/tt3915174"
    },
    "_id": "6646e1ec5a36232dce0bb3a3",
    "trailer": "https://www.youtube.com/embed/1o8GWhoD53I",
    "comments": [
        {
            "_id": "664e1b23698e490573a514ed",
            "isAdmin": false,
            "firstname": "Azamat",
            "comment": "vnin dayanina",
            "like": 1,
            "dislike": 0
        }
    ],
    "__v": 2
},
{
    "title": {
        "uz": "O'rgimchak Odam: Uyga yo'l yo'q",
        "ru": "Человек-паук: Нет пути домой",
        "en": "Spider man: No Way Home"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "Piter Parkerning maxfiy kimligi butun dunyoga oshkor bo'ldi. Yordam so'ragan Piter o'zining O'rgimchak odam ekanligini dunyoga unuttirish uchun Doktor Strenjga murojaat qiladi. Sehr dahshatli darajada noto'g'ri bo'lib, ko'p dunyoni buzadi va dunyoni vayron qilishi mumkin bo'lgan dahshatli yovuzlarni keltirib chiqaradi.",
        "ru": "Тайная личность Питера Паркера раскрыта всему миру. Отчаянно нуждаясь в помощи, Питер обращается к Доктору Стрэнджу, чтобы заставить мир забыть, что он Человек-Паук. Заклинание идет ужасно неправильно и разрушает мультивселенную, привлекая чудовищных злодеев, которые могут уничтожить мир.",
        "en": "Peter Parker's secret identity is revealed to the entire world. Desperate for help, Peter turns to Doctor Strange to make the world forget that he is Spider-Man. The spell goes horribly wrong and shatters the multiverse, bringing in monstrous villains that could destroy the world."
    },
    "releaseDate": {
        "day": "17",
        "month": "12",
        "year": "2021"
    },
    "duration": {
        "hour": "02",
        "min": "28"
    },
    "rating": {
        "like": 2,
        "dislike": 0,
        "imdb": "N/A"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Top Films",
        "ru": "Smile Movies",
        "en": "Smile Movies"
    },
    "image": {
        "portrait": "https://m.media-amazon.com/images/M/MV5BZWMyYzFjYTYtNTRjYi00OGExLWE2YzgtOGRmYjAxZTU3NzBiXkEyXkFqcGdeQXVyMzQ0MzA0NTM@._V1_FMjpg_UX1000_.jpg",
        "fullscreen": "https://img.uhdpaper.com/wallpaper/spiderman-no-way-home-movie-poster-571@1@e-preview.jpg?dl"
    },
    "status": {
        "isNew": true,
        "isTrending": true,
        "type": "movie",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://smile-movie.netlify.app/playerjs.html?file=[480p]https://topfilm.info/3/tarjima_kinolar/Orgimchak_odam_Uyga_Yol_yoq_480.mp4,[720p]https://topfilm.info/3/tarjima_kinolar/Orgimchak_odam_Uyga_Yol_yoq_720.mp4,[1080p]https://topfilm.info/3/tarjima_kinolar/Orgimchak_odam_Uyga_Yol_yoq_1080.mp4,[2160p(4K)]https://14.fayllar1.ru/14/kinolar/O'rgimchak%20odam%20U.Y.Y%202160p%20O'zbek%20tilida%20(asilmedia.net).mp4",
        "ru": "https://45535.svetacdn.in/8JRlKdovCCwf/movie/55275?block=RU,SG,NL,IN,EE,CA",
        "en": "https://vidsrc.to/embed/movie/tt10872600"
    },
    "_id": "6646e60e5a36232dce0bb3bf",
    "trailer": "https://www.youtube.com/embed/JfVOs4VSpmA",
    "comments": [],
    "__v": 1
},
{
    "title": {
        "uz": "Yangi O'rgimchak Odam 1",
        "ru": "Новый Человек-паук 1",
        "en": "The Amazing Spider Man 1"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "Piter Parker (Garfild) ota-onasi tomonidan bolaligida tashlab ketilgan va uni Ben amakisi (Shin) va Mey xolasi (Dala) tarbiyasiga qoldirgan, o'rta maktab o'quvchisi. Ko'pgina o'smirlar singari, Piter ham o'zining kimligini va qanday qilib bugungi kundagi odam bo'lganini tushunishga harakat qilmoqda. Piter, shuningdek, o'rta maktabdagi birinchi sevgilisi Gven Steysi (Tosh) bilan o'z yo'lini topmoqda va ular birgalikda sevgi, sadoqat va sirlar bilan kurashadilar. Piter otasiga tegishli bo'lgan sirli portfelni topgach, ota-onasining g'oyib bo'lishini tushunish uchun izlanishni boshlaydi - uni to'g'ridan-to'g'ri Oscorp va otasining sobiq sherigi doktor Kurt Konnors (Ifans) laboratoriyasiga olib boradi. O'rgimchak odam Konnorsning alter-egosi \"Kaltakesak\" bilan to'qnashuv yo'liga o'tayotganda, Piter o'z kuchlaridan foydalanish va qahramon bo'lish uchun taqdirini belgilash uchun hayotini o'zgartiruvchi tanlovlar qiladi.",
        "ru": "Питер Паркер (Гарфилд) — старшеклассник-изгой, которого в детстве бросили родители, оставив его на воспитание дяде Бену (Шин) и тете Мэй (Филд). Как и большинство подростков, Питер пытается понять, кто он и как ему удалось стать тем человеком, которым он является сегодня. Питер также находит свой путь со своей первой школьной любовью, Гвен Стейси (Стоун), и вместе они борются с любовью, преданностью и секретами. Когда Питер обнаруживает загадочный портфель, принадлежавший его отцу, он начинает поиски, чтобы понять исчезновение своих родителей, что приводит его прямо к Оскорпу и лаборатории доктора Курта Коннорса (Ифанс), бывшего партнера его отца. Поскольку Человек-паук находится на пути к столкновению с альтер-эго Коннорса, Ящерицей, Питеру придется принять судьбоносный выбор, чтобы использовать свои силы и сформировать свою судьбу, чтобы стать героем.",
        "en": "Peter Parker (Garfield) is an outcast high schooler who was abandoned by his parents as a boy, leaving him to be raised by his Uncle Ben (Sheen) and Aunt May (Field). Like most teenagers, Peter is trying to figure out who he is and how he got to be the person he is today. Peter is also finding his way with his first high school crush, Gwen Stacy (Stone), and together, they struggle with love, commitment, and secrets. As Peter discovers a mysterious briefcase that belonged to his father, he begins a quest to understand his parents' disappearance - leading him directly to Oscorp and the lab of Dr. Curt Connors (Ifans), his father's former partner. As Spider-Man is set on a collision course with Connors' alter-ego, The Lizard, Peter will make life-altering choices to use his powers and shape his destiny to become a hero."
    },
    "releaseDate": {
        "day": "03",
        "month": "06",
        "year": "2012"
    },
    "duration": {
        "hour": "02",
        "min": "16"
    },
    "rating": {
        "like": 0,
        "dislike": 0,
        "imdb": "6.9"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Top Films",
        "ru": "Smile Movies",
        "en": "Smile Movies"
    },
    "image": {
        "portrait": "https://i.ebayimg.com/images/g/~gEAAOSwo4pYekPb/s-l1200.jpg",
        "fullscreen": "https://c4.wallpaperflare.com/wallpaper/197/869/141/the-amazing-spider-man-movie-spider-man-poster-wallpaper-preview.jpg"
    },
    "status": {
        "isNew": false,
        "isTrending": false,
        "type": "movie",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://smile-movie.netlify.app/playerjs.html?file=[480p]https://13.fayllar1.ru/13/Yangi%20O'rgimchak%20odam%201%202012%20480p%20O'zbek%20tilida%20(asilmedia.net).mp4,[720p]https://13.fayllar1.ru/13/Yangi%20O'rgimchak%20odam%201%202012%20720p%20O'zbek%20tilida%20(asilmedia.net).mp4,[1080p]https://13.fayllar1.ru/13/Yangi%20O'rgimchak%20odam%201%202012%201080p%20O'zbek%20tilida%20(asilmedia.net).mp4",
        "ru": "https://95699.svetacdn.in/8JRlKdovCCwf/movie/1560?block=RU,SG,NL,IN,EE,CA",
        "en": "https://vidsrc.to/embed/movie/tt0948470"
    },
    "_id": "664e1e0f698e490573a51541",
    "trailer": "https://youtu.be/-tnxzJ0SSOw?si=qPihc_LwjnyPl5bU",
    "comments": [],
    "__v": 0
},
{
    "title": {
        "uz": "Venzdey",
        "ru": "Уэнсдэй",
        "en": "Wednesday"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "Syujet markazida ma'yus va lakonik chorshanba, ekssentrik Addams oilasining to'ng'ich qizi, o'zining hayratlanarli antiklari tufayli besh yil ichida sakkizta maktabni o'zgartirgan. Yana bir shov-shuvli voqeadan so'ng u ota-onasi bir paytlar qatnashgan Nevermore akademiyasiga o'tishga majbur bo'ladi. Maktabni onasi Morticianing qasamyodli dushmani Larisa Uims temir tutqich bilan boshqaradi. Bu erda qiz o'zining yangi kashf etilgan ruhiy qobiliyatlarini rivojlantiradi va bu hududda aylanib yurgan, odamlarni ovlayotgan yirtqich hayvonni to'xtatish majburiyatini oladi.",
        "ru": "Семейство Аддамсов всегда славилось своей необычностью и уникальным взглядом на этот мир. Неудивительно, что дочурка Мартиши и Гомеса также отличается от всех своих сверстников. Барышня невероятно умна и талантлива. Она становится студенткой знаменитого «Невермора». Здесь обучаются исключительно одаренные детишки, обладающие невероятными навыками. Когда-то здесь учились и ее родители. Но сама Уэнсдэй не находит это милым.\nОказавшись здесь ей приходится не только знакомиться с новыми одноклассниками и их причудами. Но еще и разгадывать таинственные тайны прошлой жизни. В этих краях обитает немало тайн и секретов. Уэнсдэй находит единомышленников и пускается в удивительный путь приключений. Несмотря на то, что он будет наполнен различными опасностями, барышня готова и дальше претворять в жизнь безумные идеи. С ее появлением жизнь многих кардинально меняется, а давние тайны раскрываются...",
        "en": "A sleuthing, supernaturally infused mystery charting Wednesday Addams' years as a student at Nevermore Academy. Wednesday's attempts to master her emerging psychic ability, thwart a monstrous killing spree that has terrorized the local town, and solve the supernatural mystery that embroiled her parents 25 years ago - all while navigating her new and very tangled relationships at Nevermore."
    },
    "releaseDate": {
        "day": "23",
        "month": "11",
        "year": "2022"
    },
    "duration": {
        "hour": "00",
        "min": "45"
    },
    "rating": {
        "like": 4,
        "dislike": 0,
        "imdb": "N/A"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Uzmovi",
        "ru": "Smile Movies",
        "en": "Smile Movies"
    },
    "image": {
        "portrait": "https://dnm.nflximg.net/api/v6/2DuQlx0fM4wd1nzqm5BFBi6ILa8/AAAAQdttJvszpXZZDRBx6bLQprJt918HrS1MGOej3W88GrkfOeL-kUJn66TfXKYxd1B7r3ZDxo2Wlo-FjgzFUvSNrR9FRSrUq-aW0Jzip6mBrJvjEm7pVt72u_XErbyxZZ5RJNJpnOdy_3z2VabskP99G_ie.jpg?r=93e",
        "fullscreen": "https://img.uhdpaper.com/wallpaper/wednesday-netflix-series-672@0@h-preview.jpg?dl"
    },
    "status": {
        "isNew": true,
        "isTrending": true,
        "type": "series",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://smile-movie.netlify.app/playerjs.html?file=[{\"title\": \"Sezon 1\",\"folder\": [{\"title\": \"1-qism\",\"file\": \"https://big24.top/Serial/Vinzdeyy/venzd%201.mp4\"},{\"title\": \"2-qism\",\"file\": \"https://big24.top/Serial/Vinzdeyy/venzd%202.mp4\"},{\"title\": \"3-qism\",\"file\": \"https://big24.top/Serial/Vinzdeyy/venzd%203.mp4\"},{\"title\": \"4-qism\",\"file\": \"https://big24.top/Serial/Vinzdeyy/venzd%204.mp4\"},{\"title\": \"5-qism\",\"file\": \"https://big24.top/Serial/Vinzdeyy/venzd%205.mp4\"},{\"title\": \"6-qism\",\"file\": \"https://big24.top/Serial/Vinzdeyy/venzd%206.mp4\"},{\"title\": \"7-qism\",\"file\": \"https://big24.top/Serial/Vinzdeyy/venzd%207.mp4\"},{\"title\": \"8-qism\",\"file\": \"https://big24.top/Serial/Vinzdeyy/venzd%208.mp4\"}]}]",
        "ru": "https://71649.svetacdn.in/8JRlKdovCCwf/tv-series/13856?block=RU,SG,NL,IN,EE,CA",
        "en": "https://vidsrc.to/embed/tv/tt13443470"
    },
    "_id": "66538d7801488bd40aed5573",
    "trailer": "https://www.youtube.com/embed/Di310WS8zLk",
    "comments": [],
    "__v": 0
},
{
    "title": {
        "uz": "Yangi O'rgimchak Odam 2",
        "ru": "Новый Человек-паук 2",
        "en": "The Amazing Spider Man 2"
    },
    "notes": {
        "uz": "Chrome foydalanuvchilar uchun Oddiysi tavsiya qilinadi, boshqalarga Originali",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "Biz har doim o'rgimchak odamning eng muhim mojarosi uning ichida bo'lganini bilganmiz: Piter Parkerning oddiy majburiyatlari va O'rgimchak odamning favqulodda mas'uliyati o'rtasidagi kurash. Ammo \"Ajoyib o'rgimchak-odam 2\" filmida Piter Parker o'zining eng katta jangi boshlanishiga oz vaqt qolganini tushunadi. O'rgimchak odam bo'lish ajoyib. Piter Parker uchun osmono'par binolar orasida suzish, qahramon bo'lishni quchoqlash va Gven bilan vaqt o'tkazish kabi tuyg'u yo'q. Ammo o'rgimchak odam bo'lish qimmatga tushadi: faqat o'rgimchak odam o'zining Nyu-Yorkdagi hamkasblarini shaharga tahdid soluvchi dahshatli yovuz odamlardan himoya qila oladi. Electro paydo bo'lishi bilan Piter o'zidan kuchliroq dushmanga qarshi turishi kerak. Va uning eski do'sti Garri Osborn qaytib kelganida, Piter uning barcha dushmanlarida bitta umumiy narsa borligini tushunadi: Oscorp.",
        "ru": "Мы всегда знали, что самый важный конфликт Человека-паука происходит внутри него самого: борьба между обычными обязанностями Питера Паркера и необычайными обязанностями Человека-паука. Но в «Новом Человеке-Пауке 2» Питер Паркер обнаруживает, что его величайшая битва вот-вот начнется. Здорово быть Человеком-Пауком. Для Питера Паркера нет ничего лучше, чем раскачиваться между небоскребами, становиться героем и проводить время с Гвен. Но за роль Человека-паука приходится платить: только Человек-паук может защитить своих собратьев из Нью-Йорка от грозных злодеев, угрожающих городу. С появлением Электро Питеру предстоит противостоять врагу, гораздо более могущественному, чем он сам. И когда его старый друг Гарри Озборн возвращается, Питер понимает, что у всех его врагов есть одна общая черта: Оскорп.",
        "en": "We've always known that Spider-Man's most important conflict has been within himself: the struggle between the ordinary obligations of Peter Parker and the extraordinary responsibilities of Spider-Man. But in The Amazing Spider-Man 2, Peter Parker finds that his greatest battle is about to begin. It's great to be Spider-Man. For Peter Parker, there's no feeling quite like swinging between skyscrapers, embracing being the hero, and spending time with Gwen. But being Spider-Man comes at a price: only Spider-Man can protect his fellow New Yorkers from the formidable villains that threaten the city. With the emergence of Electro, Peter must confront a foe far more powerful than he. And as his old friend, Harry Osborn, returns, Peter comes to realize that all of his enemies have one thing in common: Oscorp."
    },
    "releaseDate": {
        "day": "02",
        "month": "05",
        "year": "2014"
    },
    "duration": {
        "hour": "02",
        "min": "22"
    },
    "rating": {
        "like": 0,
        "dislike": 0,
        "imdb": "6.6"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Asilmedia",
        "ru": "Smile Movies",
        "en": "Smile Movies"
    },
    "image": {
        "portrait": "https://m.media-amazon.com/images/M/MV5BOTA5NDYxNTg0OV5BMl5BanBnXkFtZTgwODE5NzU1MTE@._V1_.jpg",
        "fullscreen": "https://images6.alphacoders.com/496/496034.jpg"
    },
    "status": {
        "isNew": false,
        "isTrending": false,
        "type": "movie",
        "isAvailable": true
    },
    "movie": {
        "uz": "https://smile-movie.netlify.app/playerjs.html?file=[{\"title\": \"Oddiy\", \"file\": \"[480p]https://topfilm.info/3/tarjima_kinolar/Yangi_o'rgimchak_odam_2__480.mp4,[720p]https://topfilm.info/3/tarjima_kinolar/Yangi_o'rgimchak_odam_2__720.mp4\"},{\"title\": \"Original\", \"file\": \"[480p]http://fayllar1.ru/13/Yangi%20o%27rgimchak%20odam%202%202014%20480p%20O%27zbek%20tilida%20(asilmedia.net).mp4,[720p]http://fayllar1.ru/13/Yangi%20o%27rgimchak%20odam%202%202014%20720p%20O%27zbek%20tilida%20(asilmedia.net).mp4,[1080p]http://fayllar1.ru/13/Yangi%20o%27rgimchak%20odam%202%202014%201080p%20O%27zbek%20tilida%20(asilmedia.net).mp4\"}]",
        "ru": "https://72951.svetacdn.in/8JRlKdovCCwf/movie/76?block=RU,SG,NL,IN,EE,CA",
        "en": "https://vidsrc.to/embed/movie/tt1872181"
    },
    "_id": "66576de4ed8f2f1415573bba",
    "trailer": "",
    "comments": [],
    "__v": 0
},
{
    "title": {
        "uz": "Boshqotirma 2",
        "ru": "Головоломка 2",
        "en": "Inside out 2"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "O'smir Raylining ong shtab-kvartirasi butunlay kutilmagan narsaga joy ochish uchun to'satdan vayron qilinmoqda: yangi his-tuyg'ular. Quvonch, qayg'u, g'azab, qo'rquv va jirkanish, uzoq vaqtdan beri barcha hisoblar bo'yicha muvaffaqiyatli operatsiya o'tkazayotgan, tashvish paydo bo'lganda qanday his qilishni bilmaydi. Va u yolg'iz emasga o'xshaydi",
        "ru": "Штаб-квартира разума подростка Райли подвергается внезапному сносу, чтобы освободить место для чего-то совершенно неожиданного: новых эмоций. Радость, Печаль, Гнев, Страх и Отвращение, которые, судя по всему, уже давно проводят успешную операцию, не знают, что чувствовать, когда появляется Тревога. И похоже, она не одна",
        "en": "Teenager Riley's mind headquarters is undergoing a sudden demolition to make room for something entirely unexpected: new Emotions. Joy, Sadness, Anger, Fear and Disgust, who've long been running a successful operation by all accounts, aren't sure how to feel when Anxiety shows up. And it looks like she's not alone"
    },
    "releaseDate": {
        "day": "14",
        "month": "06",
        "year": "2024"
    },
    "duration": {
        "hour": "01",
        "min": "40"
    },
    "rating": {
        "like": 0,
        "dislike": 0,
        "imdb": "N/A"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Smile Movies",
        "ru": "Smile Movies",
        "en": "Smile Movies"
    },
    "image": {
        "portrait": "https://m.media-amazon.com/images/M/MV5BYTc1MDQ3NjAtOWEzMi00YzE1LWI2OWUtNjQ0OWJkMzI3MDhmXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_FMjpg_UX1000_.jpg",
        "fullscreen": "https://images7.alphacoders.com/134/1341737.jpeg"
    },
    "status": {
        "isNew": true,
        "isTrending": true,
        "type": "cartoon",
        "isAvailable": false
    },
    "movie": {
        "uz": "",
        "ru": "",
        "en": "http://vidsrc.to/embed/movie/tt22022452"
    },
    "_id": "6666d16114a6e2b6256fccab",
    "trailer": "https://www.youtube.com/embed/LEjhY15eCx0",
    "comments": [],
    "__v": 0
},
{
    "title": {
        "uz": "Sonik 3",
        "ru": "Соник 3",
        "en": "Sonic 3"
    },
    "notes": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "description": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "releaseDate": {
        "day": "20",
        "month": "12",
        "year": "2024"
    },
    "duration": {
        "hour": "00",
        "min": "00"
    },
    "rating": {
        "like": 0,
        "dislike": 0,
        "imdb": "N/A"
    },
    "country": {
        "uz": "AQSH",
        "ru": "США",
        "en": "USA"
    },
    "credit": {
        "uz": "Smile Movies",
        "ru": "Smile Movies",
        "en": "Smile Movies"
    },
    "image": {
        "portrait": "https://i.redd.it/vxcxhchro7gc1.jpeg",
        "fullscreen": ""
    },
    "status": {
        "isNew": true,
        "isTrending": false,
        "type": "cartoon",
        "isAvailable": false
    },
    "movie": {
        "uz": "",
        "ru": "",
        "en": ""
    },
    "_id": "6666db9f14a6e2b6256fcd93",
    "trailer": "https://youtu.be/S5wdFSRYoOY",
    "comments": [],
    "__v": 0
}